uat_chat/Catalogs/уатАЗС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>уатАЗС</Name>
			<Comment>(уат)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент_Склад</Name>
					<Comment>Контрагент / склад</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоАЗССклад</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоответствиеГСМ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГСМизФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГСМ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

uat_chat/InformationRegisters/уатКартинкиИФайлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>уатКартинкиИФайлы</Name>
			<Comment>(уат)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИмяФайла</Name>
					<Comment>Исходное имя файла для сохранения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСохранения</Name>
					<Comment>Дата сохранения данных объекта</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерФайла</Name>
					<Comment>Исходный размер файла</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий к файлу / картинке</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Comment>Хранилище данных картинки или файла</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДанныеВоВнешнемФайле</Name>
					<Comment>Признак того, что данные храняться во внешнем файле</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект (справочник) для которого необходимо реализовать хренение некоторых данных (например картинок)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.уатАЗС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Comment>Идентификационная строка, разделяющая данные объекта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

uat_chat/Catalogs/уатАЗС/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт; // Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения
Перем ИмяФайлаВнешнейОбработки Экспорт; // Имя файла внеш. обработки для загрузки данных по АЗС
//Перем ФлагЗаписатьОбработкуЗагрузки Экспорт;


//Функция проверяет наличие обработки загрузки данных 
// Параметры: 	ТС - ссылка на справочник ОС
// Возвращаемое значение: Список значений
Функция ЕстьОбработкаЗагрузки() ЭКСПОРТ
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КартинкиИФайлы.Данные
	|ИЗ
	|	РегистрСведений.уатКартинкиИФайлы КАК КартинкиИФайлы
	|ГДЕ
	|	КартинкиИФайлы.Объект = &Объект
	|	И КартинкиИФайлы.Идентификатор = &Идентификатор";
	
	Запрос.УстановитьПараметр("Объект", Ссылка);
	Запрос.УстановитьПараметр("Идентификатор", "Обработка загрузки данных");
	Результат = Не Запрос.Выполнить().Пустой();
	
	Возврат Результат;
	
КонецФункции // ПроверитьОбработкуЗагрузки

#Если Клиент Тогда
	
	//Функция возвращает обработку загрузки данных 
	// Параметры: 	ТС - ссылка на справочник ОС
	// Возвращаемое значение: Список значений
	Функция ПолучитьОбработкуЗагрузки() ЭКСПОРТ
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КартинкиИФайлы.Данные
		|ИЗ
		|	РегистрСведений.уатКартинкиИФайлы КАК КартинкиИФайлы
		|ГДЕ
		|	КартинкиИФайлы.Объект = &Объект
		|	И КартинкиИФайлы.Идентификатор = &Идентификатор";
		
		Запрос.УстановитьПараметр("Объект", Ссылка);
		Запрос.УстановитьПараметр("Идентификатор", "Обработка загрузки данных");
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		Если РезультатЗапроса.Следующий() Тогда
			ИмяФайлаОбработки = КаталогВременныхФайлов() + ?(Прав(КаталогВременныхФайлов(), 1) = "\", "", "\") + "ОбработкаЗагрузкиПЦ" + СокрЛП(ЭтотОбъект.Наименование) + ".epf";
			
			Попытка
				РезультатЗапроса.Данные.Получить().Записать(ИмяФайлаОбработки);
				Возврат ВнешниеОбработки.Создать(ИмяФайлаОбработки);
			Исключение
				Предупреждение("Неправильное имя обработки для загрузки данных АЗС!
				|Для исправления внесите изменения в справочник ""АЗС""
				|для """ + СокрЛП(ЭтотОбъект.Наименование) + """");
				Возврат Неопределено;				
			КонецПопытки;	
		Иначе
			Возврат Неопределено;
		КонецЕсли;	
		
	КонецФункции // ПолучитьОбработкуЗагрузки
	
	//Функция записывает обработку загрузки данных в хранилище
	// 
	Функция ЗаписатьОбработкуЗагрузки() ЭКСПОРТ
		
		Если ЗначениеЗаполнено(ИмяФайлаВнешнейОбработки) Тогда
			ПроверкаФайл = Новый Файл(ИмяФайлаВнешнейОбработки);
			Если НЕ ПроверкаФайл.Существует() Тогда
				Сообщить("Файл <" + ИмяФайлаВнешнейОбработки + "> не обнаружен!", СтатусСообщения.Внимание);
				Возврат Ложь;
			КонецЕсли;
			
			Попытка
				Запись = РегистрыСведений.уатКартинкиИФайлы.СоздатьМенеджерЗаписи();
				Запись.Прочитать();
				Запись.Объект = Ссылка;
				Запись.Идентификатор = "Обработка загрузки данных";
				
				мОбработка = Новый ДвоичныеДанные(ИмяФайлаВнешнейОбработки);
				ХранилищеОбработки = Новый ХранилищеЗначения(мОбработка);
				Запись.Данные = ХранилищеОбработки;
				Запись.Записать(Истина);
				
				Результат = Истина;
			Исключение
				Сообщить(ОписаниеОшибки());
				
				Результат = Ложь;
			КонецПопытки;	
			
		КонецЕсли;
		
		Возврат Результат;
		
	КонецФункции // 
	
#КонецЕсли



// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СТАНДАРТНЫХ СОБЫТИЙ ОБЪЕКТА

// Стандартный обработчик ПередЗаписью элемента справочника
//
Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	уатОбщегоНазначения.уатПроверкаПравПередЗаписьюВСправочниках(ЭтотОбъект, Отказ, , Права);
	
	Если ЭтоГруппа=Ложь Тогда
	ЭтоАЗССклад = (ТипЗнч(Контрагент_Склад) = Тип("СправочникСсылка.Склады"));
	//Наименование = Контрагент_Склад.Наименование;
	КонецеСЛИ;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// сохранение ссылки на коллекцию прав, настроек и окружения
Права = Неопределено;
#Если Клиент Тогда
	Права = глПраваУАТ;
#КонецЕсли
